Tekla.Structures.ModelInternal.GraphicLine
Graphic line is a container for drawable line in Tekla Structures model view

Tekla.Structures.ModelInternal.GraphicLine.Line
Defines line position points.

Tekla.Structures.ModelInternal.GraphicLine.Color
Defines color for line.

Tekla.Structures.ModelInternal.GraphicLine.Width
Defines line width.

Tekla.Structures.ModelInternal.GraphicLine.#ctor(Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Model.UI.Color,Tekla.Structures.ModelInternal.GraphicObjectContainer.LineWidth)
Initializes a new instance of the Tekla.Structures.ModelInternal.GraphicLine class.
Default color is solid black.